let prices = {
    "كبار (+13)": {
        "جراحة الأسنان": {
            "الخلع": {
                "عادي": 500,
                "ضرس العقل": 700,
                "جراحي": 1000,
                "ضرس عقل جراحيًا": 2000
            },
            "العلاجات": {
                "تنظيف خراج": 700,
                "تنظيف جرح خلع": 400,
                "إزالة نتوء عظمي": 1000,
                "خياطة": 300
            }
        },

        "العلاج التحفظي": {
            "الحشوات": {
                "مؤقتة": 300,
                "زجاجية علاجية": 900,
                "ضوئية أمامية": 1200,
                "ضوئية خلفية": 1200,
                "حشو مرحلتين": 1500
            }
        },

        "علاج الجذور": {
            "الأسنان": {
                "علاج جذور": {
                    "أمامية": 2600
                },
                "إعادة علاج جذور": {
                    "أمامية": 3100
                }
            },
            "الضروس": {
                "علاج جذور": {
                    "أمامية": 3000,
                    "خلفية": 3400
                },
                "إعادة علاج جذور": {
                    "أمامية": 3500,
                    "خلفية": 4000
                }
            }
        },

        "اللثة": {
            "تنظيف الأسنان": {
                "روتين (جلسة واحدة)": 800,
                "عميق (2-3 جلسات)": 1200,
                "تلميع": 400
            },
            "العلاجات": {
                "إزالة جيب لثوي": 300,
                "تبييض الأسنان": 4000,
                "إزالة لثة": 200,
                "إزالة لحمية في ضرس العقل": 500
            }
        },

        "تعويضات الأسنان": {
            "أجهزة وقائية": {
                "عضة ليلية": 1000
            },
            "تعويضات متحركة": {
                "طقم جزئي": {
                    "علوي وسفلي": "600/سن",
                    "علوي أو سفلي": "600/سن",
                },
                "طقم كامل": {
                    "علوي وسفلي": 10000,
                    "علوي أو سفلي": 5000
                }
            },
            "تعويضات ثابتة": {
                "تاج زيركونيوم كامل": 3000,
                "قشور خزفية ايماكس": 4000,
                "تثبيت تاج أو إعادة تثبيت": 500,
                "زراعة الأسنان": 12000
            }
        },
    },
    "أطفال (-13)": {
        "الخلع": 400,
        "الحشوات": {
            "مؤقتة": 300,
            "زجاجية علاجية": 700,
            "ضوئية": 800
        },
        "العلاجات": {
            "نظافة الأسنان": 500,
            "تلميع الأسنان": 400,
            "إزالة لثة": 300
        },
        "التركيبات": {
            "طربوش/تاج معدني": 800
        },
        "علاج الجذور": {
            "جزئي": 1000,
            "كامل": 1800
        },
        "أدوات حفظ": {
            "حافظ أسنان": 800,
            "حافظ مسافة": 1500
        }
    }
}

let checkPoints = {
    none: "hidden",
    start: "h-full w-0.5 absolute bg-blue-600 top-1/2 translate-x-1/2 start-1/2",
    mid: "h-full w-0.5 absolute bg-blue-600 top-1/2 translate-x-1/2 start-0",
    last: "h-full w-0.5 absolute bg-blue-600 top-1/2 translate-x-1/2 -start-1/2",
}

let currentStep = 0;

// ----------------------------------------------------

const nextObj = obj => !!obj && typeof obj === "object" && Object.values(obj).filter(v => v && typeof v === "object" && !Array.isArray(v));

const getPath = (obj, target, path = []) => {
    for (let k in obj) {
        if (obj[k] === target) return [...path, k];
        if (obj[k] && typeof obj[k] === "object") {
            let p = getPath(obj[k], target, [...path, k]);
            if (p) return p;
        }
    }
};

function nextStep(step) {
    document.getElementById(".step").forEach(el => el.classList.add("hidden"));
}

// ----------------------------------------------------
